clear all;
close all;
clc;

tif_pic = dir('6297005097746432.tif');
pic=imread(tif_pic(1).name);

pic=pic>0;
[x,y]=find(pic);
xminimum=min(x);            %x取最小座標
yminimum=min(y);            %y取最小座標
xmaximum=max(x);            %x取最大座標
ymaximum=max(y);            %y取最大座標
x=x-xminimum+1;               %所有座標減去最小值,讓圖片可貼在(1,1)上
y=y-yminimum+1;               %所有座標減去最小值,讓圖片可貼在(1,1)上


sx=[x,y];

[sort_x,ind]=sort(sx(:,1));%排序x軸,並記下index

%-----------排序X軸，並透過索引將y軸對應到對的x軸-----------------
 for i=1:1:size(sort_x,1)  %排序X軸，並透過索引將y軸對應到對的x軸
     sort_x(i,2)=sx(ind(i,1),2);
 end
%--------------------------------------------------------------  
 

%-----------------------sort_x匯出來--------------------------- 
 figure
 for i=1:1:size(sort_x,1)
     plot(sort_x(i,2),-sort_x(i,1),'o');
     hold on;
 end
 %------------------------------------------------------------
 
 
 %[sort_y,ind]=sort(sx(:,2));%排序y軸,並記下index
 %sort_y(:,2)=sort_y;
 %-----------排序y軸，並透過索引將y軸對應到對的x軸-----------------
 %for i=1:1:size(sort_y,1)  %排序X軸，並透過索引將y軸對應到對的x軸
 %    sort_y(i,1)=sx(ind(i,1),1);
 %end
%--------------------------------------------------------------  


%-----------------------sort_y匯出來--------------------------- 
 %figure
% for i=1:1:size(sort_y,1)
 %   plot(sort_y(i,2),-sort_y(i,1),'o');
 %    hold on;
 %end
 %------------------------------------------------------------ 

%-------------------------測試小範例-------------------- 
% a=[20,1;20,2;21,3;22,4;24,5;24,6;25,7];
%  k=1;
% while(k<size(a,1))
%      if(a(k,1)==a(k+1,1) && abs(a(k,2)-a(k+1,2))==1)
%          a(k+1,:)=[];
%          k=k+1;
%      else
%          k=k+1;
%      end
% end
 
 
 %------------刪除x一樣,但y距離只差1的(也就是上下兩點相疊的)------
 
 %--------------------------------------------------------------
 

 

 
 
 